{
    "weights" : {
        "0" : 3,
        "1" : 3,
        "2" : 2,
        "3" : 1,
        "4" : 1
    },
    "traps" : {
        "0" : {
            "name" : "Pit Trap",
            "description" : "A pit trap is a large hole in the ground, usually covered by a thin layer of soil, leaves, or other debris. The pit is typically 10 to 20 feet deep and lined with sharp spikes or other dangerous objects. When a creature steps on the covering, it collapses, sending the creature plummeting into the pit.",
            "damage" : "2d6 piercing damage",
            "save" : "Dexterity DC 15",
            "disarm" : "Intelligence DC 15"
        },
        "1" : {
            "name" : "Arrow Trap",
            "description" : "An arrow trap is a hidden mechanism that fires a volley of arrows at anyone who triggers it. The arrows are usually poisoned or coated with some other harmful substance.",
            "damage" : "1d8 piercing damage",
            "save" : "Dexterity DC 15",
            "disarm" : "Intelligence DC 15"
        },
        "2" : {
            "name" : "Swinging Blade Trap",
            "description" : "A swinging blade trap is a large blade that swings down from the ceiling or up from the floor when triggered. The blade is usually razor-sharp and can cut through flesh and bone with ease.",
            "damage" : "2d10 slashing damage",
            "save" : "Dexterity DC 15",
            "disarm" : "Intelligence DC 15"
        },
        "3" : {
            "name" : "Fire Trap",
            "description" : "A fire trap is a hidden mechanism that releases a burst of flame when triggered. The flames are usually magical in nature and can burn for several rounds before extinguishing themselves.",
            "damage" : "2d6 fire damage",
            "save" : "Dexterity DC 15",
            "disarm" : "Intelligence DC 15"
        },
        "4" : {
            "name" : "Poison Gas Trap",
            "description" : "A poison gas trap is a hidden mechanism that releases a cloud of poisonous gas when triggered. The gas is usually colorless and odorless, making it difficult to detect until it is too late.",
            "damage" : "2d6 poison damage",
            "save" : "Constitution DC 15",
            "disarm" : "Intelligence DC 15"
        }
    },
    "costs" : {
        "0" : 1,
        "1" : 1,
        "2" : 1,
        "3" : 1,
        "4" : 1
    }
}